app/controllers/messages_controller.rb

INSERT INTO "messages" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "hi"], ["created_at", "2020-11-18 11:55:29.576419"], ["updated_at", "2020-11-18 11:55:29.576419"]]
---
    def create
      @message = Message.create(msg_params)