app/controllers/search_controller.rb

SELECT "students".* FROM "students" WHERE (LOWER("students"."first_name") ILIKE '%tom%' OR LOWER("students"."last_name") ILIKE '%tom%')
---
  def search_student
    if params["q"].present?
      abc = params["q"].downcase
    @students = Student.where(Student.arel_table[:first_name].lower.matches("%#{abc.downcase}%")).or(Student.where(Student.arel_table[:last_name].lower.matches("%#{abc.downcase}%")))