app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "email", "year_of_birth", "gender", "address", "fathers_name", "mothers_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save