app/models/user.rb

  def self.from_omniauth(auth)
    # where(provider: auth.provider, uid: auth.uid).first_or_create do |user|
    #   user.email = auth.info.email
    #   user.password = SecureRandom.base64(15)
    # end
    user = find_or_create_by(uid: auth.id, provider: auth.provider)
    user.email = auth.info.email
    user.password = SecureRandom.base64(15)
    user.confirmed_at = Time.now
    user.save(validate: false)
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "provider", "confirmed_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "users" SET "encrypted_password" = $1, "confirmed_at" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["encrypted_password", "$2a$12$z0p05WYT96vLaWBTxdy8ueYcIONmr/ycrz/MCJBqKhmdpWuec63wy"], ["confirmed_at", "2020-11-17 11:38:00.612365"], ["updated_at", "2020-11-17 11:38:00.613167"], ["id", 1]]